# Используем официальный образ Python 3.11
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями в рабочую директорию
COPY requirements.txt .

# Устанавливаем зависимости, не сохраняя кэш, чтобы образ был меньше
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы проекта из текущей папки в рабочую директорию контейнера
COPY . .

# Указываем команду, которая будет выполняться при запуске контейнера
CMD ["python", "main.py"]
